[
[
{"city": ["Rochester"], "review_content": ["I've never been to the chiropractor before but I've recently started having lower back pain as well as neck pain. After talking to a few of my family and friends, they all told me to go to the Rochester Chiropractic Group. After seeing Dr. Topor about three times I am confident in saying I won't go anywhere else. Dr. Topor is amazing at what he does and is super friendly. Even the entire staff is awesome and I've never had to wait longer then 5 minutes to see the doctor. I would highly recommend checking them out of you need a chiropractor, I always leave feeling a thousand times better then before."], "state": ["NY"], "name": "Rochester Chiropractic Group", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Canandaigua"], "review_content": ["I have trusted Dr Jen for over 20 years to take care of me. She is the very best. She is caring and professional, and will treat you like family.", "Even though I moved away, I still travel to go to her, rather than someone closer. ", "She always takes care of what is hurting and makes me feel a million times better."], "state": ["NY"], "name": "Heberle Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Canandaigua"], "review_content": ["Dr. Barnes saw me with a 30 minute warning on a Friday when every other chiropractor I called in Canandaigua was closed for the day. I actually went to her home office which is 30 minutes north of town. She did a great job and fixed my problem which developed while I was driving for 4 hours in a pouring  rainstorm from Cleveland to Can a Dega. I highly recommend Dr. Barnes she did a very effective job on diagnosing me and then treating me with manipulation and the activator."], "state": ["NY"], "name": "Heberle Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Fairport"], "review_content": ["I have been seeing Michelle for two years. She is excellent. Personable, knowledgeable, professional, and a superb masseuse. I found my home at Theratopia!"], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["5.0"]},
{"city": ["Fairport"], "review_content": ["Called 7 times over 5 hours on multiple days in order to be put on hold when a human finally answered. ", "When mentioning Groupon, there was suddenly no availability for over 7 weeks. ", "When it's easier to schedule with my physician, you can keep the unused Groupon income. Seems like you need it."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["Fairport"], "review_content": ["Maybe they have changed things since I was reading the older reviews from this past year and did not experience any of those things. I was given a gift for a one hour massage here recently. Never having one ever in my life before, I prepared for it to be a bit painful. My masseuse was extremely friendly and nice. She took me right in and made sure I was comfortable and let me know that if during the massage I was uncomfortable to let her know. I was very relaxed the entire time and thought they were very professional. I love the decor and the ambiance. I had no idea that this place was even here, though! It's quiet and relaxing. I enjoyed my time here and would come back again in the future! They offer a ton of services!"], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["4.0"]},
{"city": ["Fairport"], "review_content": ["I had a Living Social deal that had expired for a massage and facial.  I paid $89.  Living Social's policy is that the paid value never expires.  After numerous attempts to call (no one answers the phone), I was finally able to make an appointment.  I was told they no longer offer facials.  That was fine because I only had the original $89 to spend anyway.  ", "After the massage, I was told I OWED them $35. Apparently I got some heat therapy treatment (I guess putting a warm pack on your back is an extra $15+).  ", "She kept arguing that the value of my original promotion was over $240 so she wasn't going to make any money on me.  I didn't get the facial so why was she even factoring that? In the end, I paid $105 which was the full price they charge for a massage with \"heat therapy\". (By the way the massage therapist apparently wants out too because she whispered and handed me her business card for her new location).  ", "I now see Groupon deals for exactly what I had done for $46."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["Fairport"], "review_content": ["I've been to Theratopia twice now, and although my first experience with a different masseuse was average, my second message with Sue was amazing. She was friendly and relaxing, and did wonders for my neck and back. She specializes in deep tissue, but will change her pressure based on your needs and is very good about asking you if the pressure is comfortable. If you're looking for a medium or firm pressure message, I would definitely recommend asking for Sue."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["4.0"]},
{"city": ["Fairport"], "review_content": ["It took me 4 hours to make an original appt of constant calling, after I have called multiple days to make an original appt. GET AN EFFING RECEPTIONIST! They gave me the wrong date. I went on the date and time they told me and they were closed. When I tried to make a new appt they already validated my groupon vochure and said they would charge me 40 to  make another appt. EFF THAT!"], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["Fairport"], "review_content": ["After reading the less than great reviews about some people's previous Groupon experiences, I was a little wary of trying this place out.  However, I'm really glad I did!  It seems as though whatever issues they were having before have been taken seriously and rectified. I had no issues purchasing a Groupon and making a double appointment for my sister and myself.  Redeeming the Groupon when we got there was just as easy. My facial was amazing, as was my massage.  Both professionals took time to understand what I expected from my services and followed through completely with what I was promised - A relaxing massage and a great facial.  I would absolutely go back again.", "My only con is that the bathroom is down the hall and around the corner.  When you're in a bathrobe, this can be kind of awkward because there are other people/businesses around.  A private bathroom for customers would really be beneficial."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["4.0"]},
{"city": ["Fairport"], "review_content": ["Theratopia's customer service is seriously lacking.  I left a message on their answering machine to make an appointment, but I never received a return call.  ", "After not hearing from them, I called them (again) to make a massage appointment.  However, they refused to put the appointment in the book until I could provide them with a Groupon voucher number.  I explained to the woman that I had been burned by one too many Groupon business---and that I would purchase it as soon as I had a confirmed appointment (I had it up on my screen).  The woman was unrelenting and refused to make the appointment. ", "There are plenty of other massage options in the area.  Ones that have better customer service."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["Fairport"], "review_content": ["Beautiful office, disappointed that there was no restroom You have to use the public one down the hall."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["3.0"]},
{"city": ["Fairport"], "review_content": ["Ok, so the reason I'm updating my review has nothing to do with the quality of service--I still recommend them. Sue was a fantastic LMT--she will never have problems building and keeping a loyal client base given her skills. This 2nd part of my review relates to the ridiculous markup of the products they sell. ", " They sell Control Correctives skin care and I purchased 2 products because I was so pleased with the facial I received. They came to $98 plus tax.   Expensive, yes--but I admit I'm a product junkie. Unfortunately, I should've price checked before I purchased because I was so angry when I found the same products for about 45% less than what I paid. I paid $54 at the spa for a face gel but I found it for $30 on Amazon (not likely an \"off the truck\" thing--it was a reputable esthetician with high reviews and new, unused, unexpired products.  I bought it and the quality is the same as the spa). I also bought an eye cream at the spa that cost $44 but found it for $32 elsewhere. ", "So, while the spa SERVICES are great, the skin care products are extremely overpriced. I wouldn't complain if it was maybe a 10-15% markup but 45% above cost is terrible. Look online 1st before buying any products from them."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["3.0"]},
{"city": ["Fairport"], "review_content": ["Known for their best of both words (therapeutic massage & aesthetic treatments) Theratopia Spa is just that... Therapy.", "GLOW: excellent decor, spa music and atmosphere (ABSOLUTELY LOVED THE CEILINGS) ", "Therapists are Amazing... LMT, Brandi put me to sleep (in a great way). Spa Director, Aimee is a true professional. ", "GROW: historic box factory in Fairport can be a bit unwelcoming if you're unfamiliar with the area.", "Railroad Sounds", "Public Parking", "Secretarial staff (somewhat slow/limited)"], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["4.0"]},
{"city": ["Fairport"], "review_content": ["They have since moved to liftbridge lane in fairport. Beautiful spa, professional and very polite staff and relaxing music. However, as an athlete I asked for a deep tissue massage to work on the million muscle knots in my upper back and shoulders.", "Instead I got COVERED in an unnecessary amount of oil and more or less tickled for 60 minutes. I'm sure that's what most people like, but for me it was a waste- the entire appt she spent only a bit of time  on just one muscle knot.  I really don't need my fingers, toes, shins, and bottoms of my feet petted. That is NOT a deep tissue massage. ", "I'm sure this is a lovely place for easily exasperated soccer moms to be basted in too much oil and feel pampered, but if you're an athlete, steer clear, there are much better options out there for massage which will actually help your muscles recover.", "One final note, it was absolutely freezing in the massage room. Could not have been higher than 65°. I was so cold the entire time it would have been very difficult to enjoy a massage, even if it were what I had asked for.  If you like a comfortably toasty room during your massage so your muscles can actually relax, this is not the place for you."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["2.0"]},
{"city": ["Fairport"], "review_content": ["Customer service is lacking in many areas, especially with the receptionist.  Be careful when you try to use a groupon. I had a \"1 hour facial\" and the woman left the room for 15 minutes to get something from her car. Then ended the service 15 minutes early."], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["Fairport"], "review_content": ["Do NOT use them. I had a massage there and the therapist left the room for nearly 20 min, 5 min into the massage...then comes back without an explanation as if that is normal. She put hot towels on me which were cold by the time she reappeared. I had a Groupon and when I checked out, the girl at the counter told me to check out their other upcoming specials, that there would be one on Living Social & another one on Groupon. I purchased 2 massage Groupons, one for me and one for my husband. When I tried to schedule the appointments, they refused to honor my Groupon since I wasn't a \"New Client\". I explained that the staff directed me to purchase the special in spite of the verbiage on the coupon but the owner refused, said I could go on their website and take advantage of a different special because they only use Groupon to bring them new clients and they would NOT MAKE ENOUGH MONEY if they honored my Groupon. She said that Groupon charges a \"hefty fee\" and she would be PAYING for me to be there. OK, well, then instead of me returning to your sub-par business and bringing a NEW client with me, how about I return BOTH massages and never go there again? The owner said she was positive the girls would never tell someone to purchase a 2nd Groupon (essentially calling me a liar). Then as an additional slam, tells me I can go to Massage Envy or a massage school to take advantage of massages with a lower price point! She never once apologized for their mistake or made any effort to fix it. By the way, Groupon was AWESOME...refunded my money and was going to put in a request for them to stop doing business with a business that treats people like that!!"], "state": ["NY"], "name": "Theratopia Spa", "category": ["Massage", "Skin Care", "Day Spas"], "review_stars": ["1.0"]},
{"city": ["San Diego"], "review_content": ["Chiropractic: I've been going to Dr. Knepp on and off for years and he is always so amazing. Very friendly and personable and takes the time to explain everything.", "Massage: I've had many massages over the years from massage chains to the most expensive spas, and I'll never go anywhere else ever again. I had a 90 minute massage with Nick and I've never left feeling this loose and relaxed. I was so upset when it was over! Just wish I could have stayed for a nap lol", "Reception: I do agree that some of the receptionists are not always the friendliest but they do a great job. My health insurance has changed at least 3 times since I've been going there and they're always great at contacting them and getting back to me with info or anything else I need follow up on."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I love this place! Both my husband and I go here. Chiropractic services from Dr. J after my pregnancy helped get my body back in alignment and relieve lower back pain. Been going here for years for massage services too. Won't go anywhere else."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I had a massage with Stephanie Aveti, and she was amazing!  She was warm, friendly and very conscientious.  Highly recommend her"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I have been seeing Dr. Piranio for about 15 years and you cannot get better than this! He is very knowledgeable and what I like best is that he is calm. I have come in panicked not able to turn my head sideways and within a visit or two I am back to normal. I have sent friends and family in to see him as well and all of the reviews have been great!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I had a great experience going to this clinic. I recently injured myself at school, but Dr.McBride was great. I had a great experience. He knew exactly what the problem was and took the time to explain it to me. Will go back and recommend anyone."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I have to give my props to Dr. McBride. I was experiencing intense neck and upper back pain for weeks, to the point where I had to call off work, and lay low from the gym for some time. After seeing him, he was able to work out the kinks to where I'm fully functioning, and provide useful advice to avoid experiencing this type of pain again. He is very knowledgeable with what he does, and handles himself in a very professional manner. Will be coming back for any future chiropractic work. Thanks Doc!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I discovered San Diego Chiropractic group a few years ago. Dr Piranio is the best around. He is very knowledgeable at what he does. The staff is always accommodating even when I call at the last minute with a killer migraine. I've had chiropractors in the past that were unable to adjust my neck or back because of how tight I was but Dr Piranio is always able to and I almost immediately feel some relief from my adjustment. I'm very grateful for Dr Piranio and his staff including the great massage therapist. So happy my husband and I found them, we are much happier and healthy because of Dr P! I recommend them to everyone!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["1st visit today. Staff was super friendly. They were able to provide me with an appointment the same day that I called, which I totally appreciate.  Dr McBride was AWESOME! He took the time to take a complete assessment of the situation and after a couple of x-rays explained to me exactly why I'm experiencing the lower back pain that I'm having. He showed me the x-rays and pointed out how things should be aligned and where I'm out of whack. From there he did a few more assessments and treatments. By the end of the session I could already tell the difference and felt better when I left than I did when I came in. I'm looking forward to additional treatments which I know will get me back on track to being pain free. My thanks to everyone at SD Chiropractic Group."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["The receptionist was very informative and helpful when I called to make an appointment, but my experience with Dr. Mcbride is another story! His bedside manner was sloppy and when I told him he was putting me in pain he said it was to be expected with no further explanation and did not offer to change his movement type. i've been to dozens of chiropractors since I was in the army 20 years ago, and he is by far the worst, in results and personality. I would consider going back to this office if I saw a different, more knowledgable doctor in the office. But avoid Dr. Mcbride at all costs!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["1.0"]},
{"city": ["San Diego"], "review_content": ["Dr Frank Peranio is hilarious and has a great bed side manner. I was really nervous at first but Dr P knows exactly what he is doing. I was in pain for six months and then a friend finally convinced me to go see a chiropractor. After a few visits I had no pain in my SI joint. Now I just go for occasional maintenance to make sure I don't get out of whack again. I go when I need it. My husband is now a patient and so are lots of friends and co-workers. I highly recommend Dr P if you are having pain."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["5 stars for Dr. Knepp.  1 star for the receptionist.", "Dr. Knepp was very personable and made the chiropractic part of the visit very pleasant.  No complaints here at all.", "On the other hand, I had an awful experience with the receptionist.  After my visit I  was discussing the break down of my payment costs.  Asking questions about insurance, etc.  She was very short and rude with me.  And she snatched my credit card out of my hand.  Same with my insurance card.  She was clearly in a rush to get out of there to go home, and took it out on me.  This kind of behavior is absolutely unacceptable for someone in her position.    It's a shame because I thought Dr. Knepp was excellent.", "I don't think l will be going back."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["3.0"]},
{"city": ["San Diego"], "review_content": ["I was referred to Dr. Piranio by a friend. I have been to a few quack chiropractors before so I was a bit skeptical. I was welcomed to the office by the front desk staff, who both have great personalities and are very helpful. Dr. P has great beside manner, and has magical hands with such a tender caress. He really is a miracle worker when it comes to the body. I went into his office very much out of alignment, which was causing a lot of tendinitis and pain running from my shoulder down through my elbow. Within a few visits I felt like a new man. I also receive ART from Dr. McBride and he is top-notch. He has a very nice personality and is very knowledgeable about the body and how to get the muscles functioning properly. I'm a strength athlete (competitive powerlifter) so having people like this to keep me in good working order is a must. I refer everyone I know to these two and they have nothing by good things to report as well."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Piranio is amazing! ", "I have been going to chiropractor's for almost 30 years (since I was 7 years old), and this is the best and last Doctor of Chiropractic I will ever see. Dr. P is very knowledgeable of his practice. He is professional, patient, personable and works wonders on my back and neck problems.  His office staff has always been professional, courteous and willing to work me into the schedule - including last minute appointments. The office is very efficent - i love that I am in and out in 15 minutes with a great adjustment."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Piranio is awesome. He has been helping me with hip issues for over eight years. He is professional, caring, and hilarious! ", "The office staff is very nice as well. ", "Book a massage while you're there, you won't regret it. ", "Overall, this is a great place to take care of your chiropractic needs!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I've been going to the chiropractors sense 2006. I moved to San Diego and needed a chiropractors after going to a few i didn't like i found this place. I see Dr David Knepp. He is always friendly and listens to what is bothering me to make the best plan of action. The scheduling is easy to make. I even had to cancel last min and they were very understanding.  Love this place i give it a 10 out of 10.         Also mention yelp and you get a free 30 min massage (at least i did)"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I have seen many chiropractors over the years and I have to say that Dr. Piranio is one of the best. He is kind and caring and has a great sense of humor and his front office assistants always work to get you into the schedule within same day or two.  He has worked on me and with me on taking care of an acute injury to my low back. The office also has a staff of massage therapists which is a definite plus..."], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I started making appointments here a couple of years ago, and didn't realize what an awesome find they were at the time.  Dr. Knepp is terrific as my chiropractor, and I always go to Eddie for deep tissue therapy message.  They accommodated me during my transition to a new medical insurer and have always been so polite and helpful.  They recently upgraded to a cool automated touch screen check-in system, which makes things really easy for me.  Easy to see why everybody gives them 5 stars!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I own an auto repair shop and I am the sole mechanic, last week I was lifting a large tire off a truck and felt a sharp pain go down my left shoulder blade, so bad that for the first few hours it hurt to breathe or move my left arm at all, I was referred to Dr. Piranio and let me tell you if integrity and competence are things you value in a chiropractor look no further. He took me in the day before thanksgiving and checked me out told me I had popped a rib, he worked his magic and with a few cracks told me in a few days I would be 100% and if not to call him, That's it--no lets xray you all over till you glow or come see me twice a week for 6months, Dr. P knows what he is doing and just as important will not recommend anything that is NOT needed. I couldn't be happier, trust me I back to new again and would send anyone to see him! Thank you Dr. P you are the man!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["This is a wonderful chiropractor group. The office staff and doctors make you fell very comfortable, along with their massaging chairs. Dr. Jumana Jarrah is awesome. She not only does a wonderful job at helping you fix whatever problems you may be having, but she gives you stretches and exercises that will help you to maintain the progress you are trying to achieve for a long term goal. I highly recommend her !!!"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Can't say enough good things about Dr. Piranio! I had a hip problem a few years ago that a MRI, two physical therapists and an orthopedic surgeon couldn't diagnose. Dr. P did it with one x-ray, and in one summer, he completely fixed the problem. If you are going to go to a chiropractor, pick this one"], "state": ["CA"], "name": "San Diego Chiropractic Group", "category": ["Chiropractors", "Acupuncture"], "review_stars": ["5.0"]},
{"city": ["Pittsburgh"], "review_content": ["Dr. Simmons really knows his stuff. After one visit my lower back pain was 80% better. I would recommend him for anyone for pain or chiropractic maintenance."], "state": ["PA"], "name": "Dave Simmons, DC", "category": ["Chiropractors", "Sports Medicine"], "review_stars": ["5.0"]},
{"city": ["Pittsburgh"], "review_content": ["I recently started going back to the gym again and went a little to hard and heavy causing some lower back pain. I found Dr. Simmons with a Google search and made an appointment. He is a professional who knows and understands his practice. I've decided to continue visiting the office. He is helping to keep me in alignment and reduce my pain and discomfort while rebuilding strength and forming new habits with my daily posture. I'd recommend Dr. Simmons to anyone looking for chiropractic care."], "state": ["PA"], "name": "Dave Simmons, DC", "category": ["Chiropractors", "Sports Medicine"], "review_stars": ["5.0"]},
{"city": ["Pittsburgh"], "review_content": ["Dr Simmons has been treating me for several months on a weekly basis for mainly breaking down my scar tissue build up on a multiple-ruptured Achilles' tendon using the Graston technique. I was unfamiliar with the technique, but really wanted to address the stiffness and lack of flexibility in my ankle, so I could return to my activities such as running. The treatment is not for faint of heart, but is already showing results after 8 years of build up (I suggest starting as soon as possible to avoid a more challenging situation like mine.) \"Dr. Dave\" is very friendly and helpful with preparing me for more athletic activities and gives great guidance for stretches, approaches to workouts and appropriate levels of intensity given my age & condition.  He's made me aware of things I should pay attention to and how to maintain conditioning. I will continue to go to him on a regular basis because he provides extremely helpful information and want to see me back to my full physical potential and being athletic! He's been a wonderful 'coach' for my old injuries and general spine care! Highly recommended."], "state": ["PA"], "name": "Dave Simmons, DC", "category": ["Chiropractors", "Sports Medicine"], "review_stars": ["4.0"]},
{"city": ["San Diego"], "review_content": ["This place is amazing!!!I have been going here for over a year and have recently started taking my kids here. This review is about my youngest.", "My baby was about 4 weeks old, and he hadn't had a bowel movement for about 4-5 fays. I had tried most nonmedicine things that I could think of like warm bath, baby massage, baby leg cycling movements, thermometer up the bum, etc. Nothing was working, and baby seemed to be having a hard time just passing gas. It was as if baby was trying to have a bowel movement, but it hurt, so stopped trying.", "I was bringing my oldest in for an adjustment, and asked if baby could be adjusted too. It was last minute, and Dr Wilson made time for us. Baby was upset on the ride over, but calmed down once Dr Wilson did his mojo. It seems baby had some stiffness that got worked out, and we were on our way.", "After about 6 hours, baby had one of the biggest bowel movement since he came home from the hospital. It was sooooo easy for him that he didn't even cry or make any noise, but seemed quite content.", "Symmetry health and Dr Wilson are amazing. My family gets timely advice on how to improve our health, he works with us to try to fit us in with short notice, and is very friendly and a fun place to be. There are so many things in my health and lifestyle that have improved since I started coming to Symmetry health. My whole family loves the service here.", "If you are thinking about going, just make the appointment."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I couldn't function without Dr. Mick. I've been going to him consistently over the past two years and will continue to do so for as long as I'm in SD. I have fairly serious chronic pain stemming from multiple surgeries and am in need of regular adjustments to keep moving. The times I've had an emergency Mick was able to squeeze me in usually the same day or next at the most. I have referred several people to Mick and they have all had nothing but great things to say about their experiences. I've also brought in friends visiting from out of town and he was able to see them and set up a fair cash rate. ", "He doesn't make you watch any videos, require x-rays, or sell you on silly packages like other chiros I've seen. He takes the time during your first appointment to do a full assessment and develop the best plan for your needs. Your treatment is also personalized; he doesn't just do the same routine with every patient. Mick is extremely knowledgable and I wouldn't hesitate to recommend him to anyone."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Wilson is amazing and some one I trust with my life literally.  He has worked on my back on a severe auto accident. If it wasn't for him I wouldn't be back to my normal self. Now he does routine adjustments and also works on my back during my pregnancy.  ", "I definitely recommend Dr. Wilson."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I've had many past injuries to my neck and back and I have used PT and acupuncture to help with these injuries. I'm in the medical field and have some fear in choosing the right chiropractor who will help with some of my injuries. I choose Dr Mick due to some of the reviews and I went in and was impressed with his thoroughness and his ability to explain my treatment options. I hear about pushy and non-effective Chiropractors from my friends and co-workers and I have avoided them but now that I have had a couple of treatments from Dr Mick I found that they are helping. I'm looking forward to more treatments and hopefully be able to continue to get back into shape with no fear of injuring myself in the process."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Mick is the best of the best. He knows his way around a hurting body. I've been struggling with arthritis for years and can tell when a doc knows what's up. He is very thorough and goes over everything with you before he adjusts you. He made me feel at ease and did an excellent adjustment on my very first visit. He has a great \"bedside\" manner and is a great person too. I'll be referring everyone here! Thanks so much!!"], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Was in the area on vacation, threw my back out BADLY on day one.  Could not sit, stand or lay without pain.  Called about 4-5 doctors, Dr. Mick was most responsive-- even though he was fully booked that day he squeezed me in immediately.   First impression-- exterior of the building modest, but inside was super clean and bright.  Dr. Mick was so accommodating-- chatting with my 3 yr old and 7yr old who had to tag along.  Now for the exam-- he explained everything, did a good set of adjustments, plus heat/stim... and-- did not make me feel like I was imposing on him (which I was!).  He made room to see me again the very next day, same routine but also added some external taping and icy/hot.  Although I was on vacation and clearly not destined to be a long time patient, he treated me just like I was....  And best of all-- much improved every day after each treatment.  5 stars!"], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I cannot say enough things about Dr. Mick Wilson. I started going to him when he first opened up shop maybe 7 years ago. He is the only chiro I refer people to. My husband goes to him as well. He knows how to run a business with ease and making me feel like I am his only patient. I had a job where it involved heavy lifting. I was in there quite frequently, and his prices are so affordable. The best part- he texts you the next day after your treatment to ask how you are doing! The phone number is so easy to memorize I call him all the time! 270-back. I called him after I got sick on an airplane and fell asleep on the tray table, I was a mess! He had me up and running in no time. He treats you like a friend when you come in, asks about your life, while performing all my adjustments and treatments. When I first went in there about 6-7 years ago there were some \"questionable\" individuals in the waiting room. He profusely apologized and said that is now how he runs his business. Now anytime someone complains about an issue I send them here. I drive from la Mesa to pb to go there. Funny story: after my husbands first visit he goes why are all the doctors you have really good looking? Haha what can I say, I have a gift."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. MICK has my back (literally). I have been to 3 different chiropractors and he is by far my favorite. Mick is very knowledgeable and hands on he has the perfect adjustment touch. I went in after an SI injury and I have recovered completely. I still see him as part of my maintenence routine. My favorite part is when he adjusts my ribs. Because he also crossfits he understands what you put your body through and helps you recover in a very efficient and holistic way. Don't worry if you don't have insurance, because his prices are very reasonable."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I've had a lot of back and neck issues over the years. Getting regularly adjusted is the only thing that creates lasting relief. I'm fairly tall, and consequently am constantly stooping over while at work and driving. Dr. Mick is a hell of a great adjuster! Every time I leave his office I feel instant relief and light on my feet. Call Symmetry Health today."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Mick at Symmetry Health is one of the best doctors I have ever been to! I started going to him about 9 months ago and I highly recommend him to anyone who has back pain... he has helped me immensely. He is also very personable, clearly walks through what will happen at each appointment, and clearly communicates how much everything will cost. This is VERY refreshing in a world where unfortunately lots of other health care providers are not as transparent. I look forward to my appointments at Symmetry Health. HIGHLY RECOMMENDED!!"], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Mick is the best chiropractor in town. Even though I have other chiropractors in mission valley where I reside, I go see Mick in PB. ", "Mick is even a certified crossfit instructor so he can help you get in shape!"], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Mick is hands down the best chiropractor in this area. He always makes sure to find out which area I'm having the most pain in and works to eliminate the pain in that area. I always feel a million times better after I leave - and he checks in a week after an appointment to make sure I'm still doing well. Seriously, if you're looking for a chiropractor - go see Mick."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["2 years after the accident- Mick's fine work has gotten me back to boxing, trail runs and coaching sports.  On top of everything, I'm able to adjust my own back (I don't recommend this unless you're being supervised).  ", "Back feels great and alignment is on point.  Ask him about his CrossFit gym too."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Let me know if you have found a better chiropractor than Mick. I found him on the internet because I needed a chiropractor close by. I had a pinched nerve in my neck and had lost feeling in my fingers. He was honest, direct and had great prices. He did way more than adjustments with me. He worked on stretches to help keep my muscle loose and helped with nutrition and workout plans to stay healthy."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I have so many positive things to say about Dr. Mick and Symmetry Health as a whole!  I was having lower back pain and spasms and honestly after just one visit I was feeling so much better.  My husband has also been seeking treatment from Dr. Mick (specifically for lower back & neck pain caused by computer work) and he too felt an immediate improvement.", "Dr. Mick takes a true physical therapy and chiropractic approach to each of his patients.  He really takes the time to understand the location and cause of your pain as well as an overall assessment of where you may benefit from some adjustments and his physical therapy techniques.  He relieved me of pain and helped increase my mobility in joints that I did not even realize I was having problems with.  But believe me, after the adjustments and therapy I can tell you that I was in minor pain before - just due to living an active lifestyle. Now I am happily reminded that this is what healthy feels like! :)", "Not only are Dr. Mick's skills top-notch, but his friendly and approachable attitude is a HUGE PLUS!  Dr. Mick is like visiting with a friend.  He is very friendly, and keeps his patients comfortable as well as well-informed.  I personally love that he shares the reasons behind exercises and ensures that I have a true understanding of my treatment.  You will be satisfied times 10 if you decide to receive treatment by Dr. Mick."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Mick is great! First of all I owe Dr. Mick a lot because he was the person who encouraged me to try CrossFit. Not only has CrossFit been a great personal gain but the increased strength in my back, and supporting muscles has alleviated some chronic pain I've had for years. Dr. Mick always manages to squeeze me in when I call for a last minute adjustment when I'm really hurting, he's friendly as friendly gets, is knowledgeable in his field and a great resource to have. If you CrossFit seeing Dr. Mick is a must - he gets what we put our bodies through by being a coach/ owner of another CrossFit gym. If you don't do CrossFit seeing Dr. Mick is still a must for his professionalism and excellent care."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Mick knows his stuff!  I try to get see him every so often and get adjusted.  As a nurse being on my feet all day get adjusted helps me sleep well and helps my back feel better at work.   Also, he takes insurance!  I highly recommend Mick as a chiropractor."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["If you have chronic pain like me, then I suggest you give Symmetry a try. I've been going to chiropractic for many years and I have to say that Dr. Wilson definitely is my favorite. He is very personable and helpful. You can't help but feel comfortable and know you're in good hands with him. He also on different occasions gets me in for an appointment on very such notice when I'm hurting.  Symmetry also has a doctor that specializes in natural medicine and herbs. I got my first B 12 shot today. She was really nice and knowledgable and will definitely be adding the shots to my chiropractic visits too."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["Dr. Mick Wilson is really friendly, personable and comfortable to be adjusted by. He is very in tune with how your body reacts to his adjustments. There is no pressure to sign up for a long term health plan. He really knows his biology and can make good recommendations for exercises and follow-up activities that can reduce pain and increase flexibility. He makes appointments as needed, and often on the fly. If you're not sure about chiropractic and just want to try it out I recommend this doctor because of the no pressure situation. I've been other places in the past where one visit becomes thirty and you're not even sure you needed the second one in the first place. If you're not comfortable being manually adjusted he has the machine that \"thumps\" you. It's an acceptable alternative, but his manual adjustments are better."], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["San Diego"], "review_content": ["I've been going to  Dr. Mick for about 2 years and always walk away feeling so much better, but today was a different story. After a 3 day headache from a combination of stress, sleep deprivation and wreck that nursing a newborn puts on your neck and shoulders I walked out of his office with out a headache instantly!  I'm still in shock that my headache (which I rarely get headaches) went away so quickly after being adjusted.  He's great at what he does and is always willing to work me into his busy schedule. I regret waiting 3 days to see him, my head hurt to bad to think straight obviously!"], "state": ["CA"], "name": "Symmetry Health", "category": ["Chiropractors", "Naturopathic/Holistic"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["To be honest, I was skeptical of a franchised chiropractic office, but trusted the reviews.  WOW.  I'm impressed!  Dr Judge is very competent, thorough, and can quickly and accurately assess issues.  The office system is ingenious and easy, and surroundings spa-like.  I love it!!!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I come here about once a month to help my crooked back. As far as convenience goes, you can't beat The Joint. I come in during my lunch hour and I'm in and out within 15 minutes. ", "Dr. Judge is great. Twice I've had to come in because I injured myself to the point of limited mobility. Both times I was back to normal within a few days. The most recent was a shoulder injury. I was actually out of town when this happened and went to a full service chiropractor seeking relief. The other chiropractor hooked me up to a bunch of fancy  machines and... no results. Time and money wasted.  Came back to Dr. Judge yesterday and immediate relief. ", "If you have any issues with your back, I highly recommend coming in for an adjustment before you seek additional, expensive treatment."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["What a great job Dr Judge did! He adjusted 3 of us and we're all happy with the results. Highly recommend him!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Excellent adjustment!!!  We travel around in our motor home so we have been to many different clinics, and this particular location is the BEST of all of them.  The doctor took time to explain what is going on with my back, and also to offer some stretching tips.  I highly recommend this location!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I've been coming here to Dr. Judge for 2yrs now and absolutely love the results I get from my adjustment! This really is amazing solution for my family on prevenative healthcare. When my family and I have any first signs of illness, our 1st stop is Dr. Judge! Our bodies have the ability to heal itself with the help of Dr. Judge."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I'm so happy I came in, really can't explain to you how much pain I'm in almost daily with my lower back and hips. Dr.judge took care of me and had me out in 10 mins, I'll be back for sure"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Amazing adjustment. Dr judge is on point. He helped me get my head on straight. ", "Took me right away and really helped me. ", "Highly recommend."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["This place is great, the idea is great and the chiro Dr. Judge is the best. He is efficient very kind and helpful. I wish I lived closer to this place. I would be here more often."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I've been to countless chiropractors over the last 15 years or so.  Dr. Judge at The Joint Scottsdale Lincoln Village is by far the best I've been to and he has my business for the long term.  Dr. Judge is always able to easily uncover any issues I may be having, and correct them.  For years, I'd walk around in pain much of the time. Since making regular visits to Dr. Judge, I've been basically pain-free, and it's easy to drop by The Joint a few times a month for preventative maintenance.  ", "Not only is Dr. Judge an excellent chiropractor, but he's a great guy and always a pleasure to talk to.  I couldn't be more pleased with my experience at this location of The Joint."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["This is a great new business model for chiropractic care. With no appointments, affordable pricing, and fast service (usually less than ten minutes), The Joint is a highly rewarding experience. At this franchise, Dr. Judge does a great job of treating specific ailments such as jaw or lower back pain. The reception area is modern and has a relaxing vibe to it. Service from the reception desk is always great as well."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I had a recent flare up of sciatica and despite a couple visits to my regular chiropractor, I had been researching other options and came across the Joint on my Yelp app. ", "I heard about them on the radio and they are indeed your  \"Massage Envy\" type setup. I was particularly happy because they are open at this location until 4pm on Saturdays and I was urgently seeking some more relief due to the pain in my lower back. I managed to get in around 3 and was very thankful for it. I had Dr. Hornback who seems to only be there on weekends but for the into price of $19 I got one of the best adjustements I can remember and he also gave me some suggestions and a brief overview of my tension points. ", "I may be wary still of getting into monthly contracts but for those of you who are seeking frequent adjustments or often have back pain, the setting is relaxed and professional, service is friendly and helpful and at a great price especially wih the packages they offer. Look forward to going to them again if the need arises."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I was Looking for a new chiropractor close by my house and choose the Joint because of its proximity and expansive hours.  I was leery because it's a chain operation, but thought I'd give them a try.  Frankly I was totally blown away.  Pleasant waiting room environment and after filling out a thorough, but not tedious, new patient form, I was called back when it was my turn (about a 10 minute wait) and the Doctor went over my history then described how their adjustment process worked, which is all hands on. I  Was very pleased with the service and the quality of the doctor who adjusted me.  I've been going to chiropractors for years but that was the most thorough adjustment I've ever had.  Even with the initial consult I was out of there in like 25 mins.  Highly recommend this place, if your looking for a new practitioner."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Awesome!!! I am terrified to be adjusted and he was very professional and walked me through everything before and during the procedure. I will be back for sure!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Was in from out of town on business and had major issues with my lower back. Filled out the mandatory new patient info and was in immediately. Dr Judge was very thorough going over my issues and past history. He did a complete head to toe adjustment which brought immediate relief.  I highly recommend the Joint and the expertise and Dr Judge and his staff."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Dr. Judge = Awesome Chiropractic Care", "I don't know how many times he has had to \"set me right\" - not straight, that's a bad thing. Great place, conveniently located, friendly staff. I've sent family and when asked, will always recommend. - what more can I say but this is a far overdue review!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Dr.Judge is amazing! He saves me time to time from painful headaches, and he is the first person I went to see when I threw my back out. There is no sales pitch, no bs... He is good at what he does and can relieve pain instantly. I sent a couple people there, and they were really grateful!", "Pricing is good and walk in whenever you want. Membership is a no brainer!"], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["Went back recently with a hip flexor and dr. Judge was very honest with me rather than just adjusting me and charging me money he recommended massage and other tips without charging me a dime."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I just visited The Joint and I am very pleased. No hard sell just very good care!  I will go back if needed."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Scottsdale"], "review_content": ["I like this place because it's a bare bones (sorry about the pun!) way of getting chiropractic care. There are no x-rays or other expensive ploys to chisel you. Instead you just go in and get the joints cracked. ", "The only thing I don't like is that if you get on their auto bill plan there is a 30 day notice to stop billing the credit card. So, even if you want to quit you have to buy another month of treatments. The good thing is that the prices are very low.", "The chiropractor that treated me was friendly and professional, and I think he did an outstanding job of cracking my stiff neck and back. ", "The other thing I like is that you can go to any of their offices to get treatment because they are all networked together. So far I have been to two offices and was satisfied both times."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["4.0"]},
{"city": ["Scottsdale"], "review_content": ["First time in. Front desk was helpful and did not try to sign me up for any contracts. Dr. Judge was knowledgeable and confident. Cost is less than most co pays. I will be back with my back."], "state": ["AZ"], "name": "The Joint Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Baltimore"], "review_content": ["I have had scoliosis since I was a teenager. I've seen a couple doctors, who told me there was nothing that could be done, and gone to a couple of chiropractors, who helped some but it wasn't a permanent fix. A few months ago I collapsed on my sofa with sciatica. Living Wellness saw me that same day, I had an adjustment and immediately felt better. ", "At the follow up appointment, I signed on for an intensive treatment plan. ", "Not only was everyone there super nice and knowledgeable, but I just discovered I GREW ONE INCH since my treatment (which ended about two months ago). At 46.5 years old, it's pretty exciting to know that I'm taller than I was a few months ago.", "This was the most intensive treatment I've ever had for my scoliosis (3x per week, with traction machines and other exercises on top of adjustments). Yes, it was expensive and my insurance sucks, but I feel better and am taller! I think the cost is worth it. I'd rather pay now than need a hip replacement or some other awful surgery down the road."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Baltimore"], "review_content": ["Terrible. Tried to scare my girlfriend into getting 3X weekly adjustments! She went to a trusted family friend who is a chiropractor and they told her all she needed was stretches and monthly massages. This place will try to scare and upsell you. AVOID! Very untrustworthy. ", "Furthermore their Google reviews are all overwhelmingly positive and all of them smack of generic shit anyone could write, nothing specific. I suspect the reviews were made by office staff or the docs."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["1.0"]},
{"city": ["Baltimore"], "review_content": ["I don't like their high pressured sales tactics and they wanted upfront payment for 65 visits.  Also, I found errors in their cost estimates and insurance coverage projection.", "They renamed their practice;  and it is now called Advanced Medical Center:  ", "If I had read the reviews here, I would have never gone this center.   The staff seem pleasant but the chiropractic services are not helping.  Some days after a visit, I feel worse for a couple of days.  I would avoid this place."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["1.0"]},
{"city": ["Baltimore"], "review_content": ["Great, friendly office! The doctor their gives amazing adjustments totally got rid of my pain. They really know what they are doing.  They found something on my X-ray that no other chiropractor has found & I have been going to Chiro for years!"], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Baltimore"], "review_content": ["Love this place!!  From the first time I walked in and was greeted at the front desk by the smiling receptionist I knew this was the chiropractor for me.  They give great education and want you to know what is happening with your body.  The doctors are friendly, and want to help you not only feel better, but to help fix what's causing the pain.  My treatment is great, it consists of exercises to help my posture, chiropractic adjustment and then rehab machines to help fix what they found on my xrays.  I'm really glad that I chose to go here.  I can see myself continuing in this office for a long time."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["5.0"]},
{"city": ["Baltimore"], "review_content": ["This is a long story. Living Wellness goes around to local schools and offers free massages for the staff members in the break room. I took them up on their offer 3 years ago. I was pregnant at the time and was told that I really shouldn't get the massage but that they would see me in their office and offered a pregnancy safe water chair massage. I was totally fine with that and went in. Well, as another reviewer pointed out, the initial visit takes forever. I was there for at least a hour and a half. No doctor ever looked at my back or examined my spine. I was unable to get X-rays because I was pregnant. However, they came up with a pregnancy treatment plan and asked me to come in 3x a week! I was working full time and in grad school and decided to pass.  I got many phone calls after the visit trying to schedule a follow up appointment but I was just turned off from their office.", "That isn't my biggest problem with the office. I continue to get letters, sent from Dr Cohen, that he is very concerned about my xrays and is worried about my nervous system and overall health.  I NEVER GOT XRAYS!  (I actually just received a letter today, 3 years later!) They are using scare tactics to get people to come in! Chiropractors can be so amazing and helpful-but have a hard enough time defending their profession without an office lying about treatments I need."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["1.0"]},
{"city": ["Baltimore"], "review_content": ["I would not recommend this practice to anyone. I have been to see many doctors, chiropractors, physical therapists, alternative medicine practitioners, etc., and I have never experienced such poor service. I couldn't disagree more with the other reviews.", "When I arrived for any initial visit, I waited for AN HOUR before I was seen by a counselor (not even the real doctor). During this hour, I had to fill out countless forms (most offices send forms in advance of your appointment, to cut down on wait time). I also had to watch an awful, corny movie from 1990 that told me how Chiropractic works. THEN, I had to read a series of laminated brochures. ", "After an hour, I was taken into an office with a counselor, where she proceeded to ask me a series of questions, most of which I had already answered on the 15 pages of paperwork I had already filled out. Then, she proceeded to quiz me (seriously, I'm not joking) on what I had read in the pamphlets! ", "The counselor asked me if I was ready for my xrays. Xrays? I haven't even seen the doctor yet. No one has felt my spine or examined me, and they already are telling me that I need xrays? I had to pay the full price for the xrays now, up front, and they would reimburse me later based on my insurance plan. (It is now 2 months later, and I am currently after them because they have neither 1. submitted to my insurance company or 2. reimbursed me for any amount. I cannot get anyone at the office to return my calls.)", "THEN, they took me to another area where I waited for the doctor for another 10 minutes. Finally the doctor came in, pressed in a few places, asked me more questions I had already answered, and took my xrays. After that, I waited another 10 minutes to be adjusted by a different doctor.", "A week later, I came back in to review my xrays. AGAIN I had to watch a different movie! And read different pamphlets! And again I had to meet with the counselor, who again quizzed me on the movie and pamphlets! ", "After we reviewed the xrays with the first doctor, they informed me that I would need to come for 60 visits. I would have to sign a contract agreeing to come for all 60 visits, and if I missed one without rescheduling right away, I'd be fined! I would have to come three times a week, no exceptions. The total expense for the 60 visits (even with my insurance's contribution) was over $1500. You had to either pay up front, pay as you went, or set up an auto debit, but you had to sign a contract AGREEING TO PAY FOR 60 VISITS. Is this a doctor's office or a car dealership?", "I left and went to another chiropractor in the area, who told me this place is notorious. Since, I have met several other people who had negative experiences with this practice--some even got into legal disputes over their chiropractic \"contract.\""], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["1.0"]},
{"city": ["Baltimore"], "review_content": ["Rude front line staff. Turned me off completely. If I could get by with giving them 0 stars, I would. Go elsewhere."], "state": ["MD"], "name": "Living Wellness Chiropractic", "category": ["Chiropractors"], "review_stars": ["1.0"]},
